# HourSquareFootDegreesFahrenheitPerBritishThermalUnit Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..HourSquareFootDegreesFahrenheitPerBritishThermalUnit Property
UnitTypeId Class See Also
---
Hour square foot degrees Fahrenheit per British thermal unit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId HourSquareFootDegreesFahrenheitPerBritishThermalUnit { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HourSquareFootDegreesFahrenheitPerBritishThermalUnit As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ HourSquareFootDegreesFahrenheitPerBritishThermalUnit {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace